[
  {
    "id": "trygg",
    "title": "Trygg.es",
    "description": "A static website built for a small keyholding and home service company in Spain, showcasing services, pricing, and contact information.",
    "tags": ["Next.js", "React", "Tailwind", "Motion", "Figma"],
    "features": [
      "Clear presentation of services and pricing",
      "Responsive design for all devices",
      "Custom design and copywriting"
    ],
    "process": "Created the visual design in Figma, crafted the website copy, and developed the site with Next.js, React, and Tailwind to deliver a clean and responsive presentation.",
    "learning_outcomes": "Learned how to translate a company's brand and values into a functional website, adapting design and tone to suit the client and their audience.",
    "repo": "https://github.com/scmo-1/TryggHemservice.git",
    "live": "https://trygg-hemservice.vercel.app/se",
    "status": "Live",
    "year": 2025,
    "image": "/images/Trygg.webp"
  },
  {
    "id": "whereitsat",
    "title": "Where it's @",
    "description": "A mobile-first React app built as a school project, showcasing local music events. The task was to implement a Figma design with pixel-perfect accuracy while adding custom touches like a dynamic menu.",
    "tags": ["React", "Zustand", "Material UI", "Motion"],
    "features": [
      "Mobile-first design",
      "Dynamic event listings fetched from an API",
      "Ticket generation with unique 5-character IDs",
      "Smooth animations with Motion",
      "Modular component structure following best practices"
    ],
    "process": "Implemented the frontend from a Figma mockup, handled state management with Zustand, integrated Material UI and external libraries, and ensured pixel-perfect mobile UI.",
    "learning_outcomes": "Learned to translate detailed designs into responsive React components, manage complex state with Zustand, and integrate third-party libraries to enhance functionality and user experience.",
    "repo": "https://github.com/scmo-1/where-its-at.git",
    "live": null,
    "status": "Completed",
    "year": 2025,
    "image": "/images/WhereItsAt.webp"
  },
  {
    "id": "airbean",
    "title": "Airbean API",
    "description": "A school project where the first part involved building a backend REST API for a fictional coffee delivery service as a group, followed by an individual extension creating protected admin endpoints for menu management.",
    "tags": ["Node.js", "Express", "MongoDB", "REST API", "Swagger"],
    "features": [
      "CRUD operations for menu, orders, and accounts",
      "User authentication with unique IDs",
      "Admin endpoints for managing menu items",
      "Validation and error handling",
      "Swagger API documentation",
      "Agile teamwork with GitHub Projects"
    ],
    "process": "Contributed to building the initial group API and independently implemented admin endpoints with secure access, input validation, and Swagger documentation.",
    "learning_outcomes": "Gained experience in backend development, RESTful API design, database management with MongoDB, and agile teamwork practices. Learned to implement authentication, role-based access control, and documentation for APIs.",
    "repo": "https://github.com/scmo-1/Airbean_restAPI.git",
    "live": null,
    "status": "Completed",
    "year": 2025,
    "image": "/images/Airbean.webp"
  },
  {
    "id": "myportfolio",
    "title": "Personal Portfolio",
    "description": "My own portfolio website built to showcase projects and skills, designed with a personal aesthetic while exploring advanced React techniques and animations with Motion.",
    "tags": ["Next.js", "React", "Tailwind CSS", "Motion"],
    "features": [
      "Custom design and layout created from scratch",
      "Smooth animations and transitions using Motion",
      "Responsive design for all devices",
      "Dynamic project rendering from JSON data"
    ],
    "process": "Responsible for the full design and development of the site, focusing on user experience, responsive layout, and implementing smooth animations with Motion.",
    "learning_outcomes": "Enhanced my skills in React, Next.js, Tailwind CSS, and animation with Motion, while practicing translating design ideas into functional web components.",
    "repo": "https://github.com/scmo-1/portfolio.git",
    "live": null,
    "status": "Live",
    "year": 2025,
    "image": "/images/Portfolio.webp"
  }
]
